layer {
  name: "data"
  type: "Data"
  top: "data"
  data_param {
    source: "/home/allanma/data/hairlmdb/realdata/train_data"
    batch_size: 4
    backend: LMDB
  }
}
layer {
  name: "label"
  type: "Data"
  top: "label"
  data_param {
    source: "/home/allanma/data/hairlmdb/realdata/train_label"
    batch_size: 4
    backend: LMDB
  }
}
layer {
  name: "initial_conv"
  type: "Convolution"
  bottom: "data"
  top: "initial_conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "initial_relu"
  type: "ReLU"
  bottom: "initial_conv"
  top: "initial_conv"
}
layer {
  name: "conv_dw_1"
  type: "Convolution"
  bottom: "initial_conv"
  top: "conv_dw_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 16
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "conv_sep_1"
  type: "Convolution"
  bottom: "conv_dw_1"
  top: "conv_sep_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "relu_1"
  type: "ReLU"
  bottom: "conv_sep_1"
  top: "conv_sep_1"
}
layer {
  name: "conv_dw_2"
  type: "Convolution"
  bottom: "conv_sep_1"
  top: "conv_dw_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 32
    stride: 2
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "conv_sep_2"
  type: "Convolution"
  bottom: "conv_dw_2"
  top: "conv_sep_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "relu_2"
  type: "ReLU"
  bottom: "conv_sep_2"
  top: "conv_sep_2"
}
layer {
  name: "conv_dw_3"
  type: "Convolution"
  bottom: "conv_sep_2"
  top: "conv_dw_3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 64
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "conv_sep_3"
  type: "Convolution"
  bottom: "conv_dw_3"
  top: "conv_sep_3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "relu_3"
  type: "ReLU"
  bottom: "conv_sep_3"
  top: "conv_sep_3"
}
layer {
  name: "conv_dw_4"
  type: "Convolution"
  bottom: "conv_sep_3"
  top: "conv_dw_4"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 64
    stride: 2
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "conv_sep_4"
  type: "Convolution"
  bottom: "conv_dw_4"
  top: "conv_sep_4"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "relu_4"
  type: "ReLU"
  bottom: "conv_sep_4"
  top: "conv_sep_4"
}
layer {
  name: "conv_dw_5"
  type: "Convolution"
  bottom: "conv_sep_4"
  top: "conv_dw_5"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 128
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "conv_sep_5"
  type: "Convolution"
  bottom: "conv_dw_5"
  top: "conv_sep_5"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "relu_5"
  type: "ReLU"
  bottom: "conv_sep_5"
  top: "conv_sep_5"
}
layer {
  name: "conv_dw_6"
  type: "Convolution"
  bottom: "conv_sep_5"
  top: "conv_dw_6"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 128
    stride: 2
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "conv_sep_6"
  type: "Convolution"
  bottom: "conv_dw_6"
  top: "conv_sep_6"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "relu_6"
  type: "ReLU"
  bottom: "conv_sep_6"
  top: "conv_sep_6"
}
layer {
  name: "conv_dw_7"
  type: "Convolution"
  bottom: "conv_sep_6"
  top: "conv_dw_7"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 256
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "conv_sep_7"
  type: "Convolution"
  bottom: "conv_dw_7"
  top: "conv_sep_7"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "relu_7"
  type: "ReLU"
  bottom: "conv_sep_7"
  top: "conv_sep_7"
}
layer {
  name: "conv_dw_8"
  type: "Convolution"
  bottom: "conv_sep_7"
  top: "conv_dw_8"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 256
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "conv_sep_8"
  type: "Convolution"
  bottom: "conv_dw_8"
  top: "conv_sep_8"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "relu_8"
  type: "ReLU"
  bottom: "conv_sep_8"
  top: "conv_sep_8"
}
layer {
  name: "conv_dw_9"
  type: "Convolution"
  bottom: "conv_sep_8"
  top: "conv_dw_9"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 256
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "conv_sep_9"
  type: "Convolution"
  bottom: "conv_dw_9"
  top: "conv_sep_9"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "relu_9"
  type: "ReLU"
  bottom: "conv_sep_9"
  top: "conv_sep_9"
}
layer {
  name: "conv_dw_10"
  type: "Convolution"
  bottom: "conv_sep_9"
  top: "conv_dw_10"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 256
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "conv_sep_10"
  type: "Convolution"
  bottom: "conv_dw_10"
  top: "conv_sep_10"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "relu_10"
  type: "ReLU"
  bottom: "conv_sep_10"
  top: "conv_sep_10"
}
layer {
  name: "conv_dw_11"
  type: "Convolution"
  bottom: "conv_sep_10"
  top: "conv_dw_11"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 256
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "conv_sep_11"
  type: "Convolution"
  bottom: "conv_dw_11"
  top: "conv_sep_11"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "relu_11"
  type: "ReLU"
  bottom: "conv_sep_11"
  top: "conv_sep_11"
}
layer {
  name: "conv_dw_12"
  type: "Convolution"
  bottom: "conv_sep_11"
  top: "conv_dw_12"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 256
    stride: 2
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "conv_sep_12"
  type: "Convolution"
  bottom: "conv_dw_12"
  top: "conv_sep_12"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "relu_12"
  type: "ReLU"
  bottom: "conv_sep_12"
  top: "conv_sep_12"
}
layer {
  name: "conv_dw_13"
  type: "Convolution"
  bottom: "conv_sep_12"
  top: "conv_dw_13"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 512
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "conv_sep_13"
  type: "Convolution"
  bottom: "conv_dw_13"
  top: "conv_sep_13"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "relu_13"
  type: "ReLU"
  bottom: "conv_sep_13"
  top: "conv_sep_13"
}
layer {
  name: "Deconvolution1"
  type: "Deconvolution"
  bottom: "conv_sep_13"
  top: "Deconvolution1"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 512
    bias_term: false
    kernel_size: 2
    stride: 2
    weight_filler {
      type: "bilinear"
    }
    engine: CAFFE
  }
}
layer {
  name: "skip1"
  type: "Convolution"
  bottom: "conv_sep_11"
  top: "skip1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "up1"
  type: "Eltwise"
  bottom: "Deconvolution1"
  bottom: "skip1"
  top: "up1"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "filt1_dw"
  type: "Convolution"
  bottom: "up1"
  top: "filt1_dw"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 512
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "filt1_sep"
  type: "Convolution"
  bottom: "filt1_dw"
  top: "filt1_sep"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "filt1"
  type: "ReLU"
  bottom: "filt1_sep"
  top: "filt1_sep"
}
layer {
  name: "Deconvolution2"
  type: "Deconvolution"
  bottom: "filt1_sep"
  top: "Deconvolution2"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 16
    bias_term: false
    kernel_size: 2
    stride: 2
    weight_filler {
      type: "bilinear"
    }
    engine: CAFFE
  }
}
layer {
  name: "skip2"
  type: "Convolution"
  bottom: "conv_sep_5"
  top: "skip2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "up2"
  type: "Eltwise"
  bottom: "Deconvolution2"
  bottom: "skip2"
  top: "up2"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "filt2_dw"
  type: "Convolution"
  bottom: "up2"
  top: "filt2_dw"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 16
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "filt2_sep"
  type: "Convolution"
  bottom: "filt2_dw"
  top: "filt2_sep"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "filt2"
  type: "ReLU"
  bottom: "filt2_sep"
  top: "filt2_sep"
}
layer {
  name: "Deconvolution3"
  type: "Deconvolution"
  bottom: "filt2_sep"
  top: "Deconvolution3"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 16
    bias_term: false
    kernel_size: 2
    stride: 2
    weight_filler {
      type: "bilinear"
    }
    engine: CAFFE
  }
}
layer {
  name: "skip3"
  type: "Convolution"
  bottom: "conv_sep_3"
  top: "skip3"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "up3"
  type: "Eltwise"
  bottom: "Deconvolution3"
  bottom: "skip3"
  top: "up3"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "filt3_dw"
  type: "Convolution"
  bottom: "up3"
  top: "filt3_dw"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 16
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "filt3_sep"
  type: "Convolution"
  bottom: "filt3_dw"
  top: "filt3_sep"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "filt3"
  type: "ReLU"
  bottom: "filt3_sep"
  top: "filt3_sep"
}
layer {
  name: "Deconvolution4"
  type: "Deconvolution"
  bottom: "filt3_sep"
  top: "Deconvolution4"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 16
    bias_term: false
    kernel_size: 2
    stride: 2
    weight_filler {
      type: "bilinear"
    }
    engine: CAFFE
  }
}
layer {
  name: "skip4"
  type: "Convolution"
  bottom: "conv_sep_1"
  top: "skip4"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "up4"
  type: "Eltwise"
  bottom: "Deconvolution4"
  bottom: "skip4"
  top: "up4"
  eltwise_param {
    operation: SUM
  }
}
layer {
  name: "filt4_dw"
  type: "Convolution"
  bottom: "up4"
  top: "filt4_dw"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 16
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "filt4_sep"
  type: "Convolution"
  bottom: "filt4_dw"
  top: "filt4_sep"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "filt4"
  type: "ReLU"
  bottom: "filt4_sep"
  top: "filt4_sep"
}
layer {
  name: "up5"
  type: "Deconvolution"
  bottom: "filt4_sep"
  top: "up5"
  param {
    lr_mult: 0.0
    decay_mult: 0.0
  }
  convolution_param {
    num_output: 16
    bias_term: false
    kernel_size: 2
    stride: 2
    weight_filler {
      type: "bilinear"
    }
    engine: CAFFE
  }
}
layer {
  name: "filt5_dw"
  type: "Convolution"
  bottom: "up5"
  top: "filt5_dw"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 16
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "filt5_sep"
  type: "Convolution"
  bottom: "filt5_dw"
  top: "filt5_sep"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "filt5"
  type: "ReLU"
  bottom: "filt5_sep"
  top: "filt5_sep"
}
layer {
  name: "output_dw"
  type: "Convolution"
  bottom: "filt5_sep"
  top: "output_dw"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 16
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 16
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "output_sep"
  type: "Convolution"
  bottom: "output_dw"
  top: "output_sep"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 2
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "msra"
    }
    engine: CAFFE
  }
}
layer {
  name: "output"
  type: "ReLU"
  bottom: "output_sep"
  top: "output_sep"
}
layer {
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "output_sep"
  bottom: "label"
  top: "loss"
  loss_param {
    normalize: false
  }
}
